import { describe, expect, test } from 'vitest';

import { shortenByWord } from './shortenByWord.js';

describe('shortenByWord', () => {
  test.each<[string, string]>([
    ['abc', 'abc'],
    ['0123456789 hello', '0123456789'],
    ['0123456789hello;abc', '0123456789hello'],
    ['0123456789helloabc', '0123456789helloabc'],
    ['01234567      a', '01234567'],
  ])('special case', (input, expected) => {
    const actual = shortenByWord(input, 10);

    expect(actual).toEqual(expected);
  });

  test.each<[string, string]>([
    [
      String.raw`З 27 по 31 січня у смт Славсько (Львівська обл.) проходив тиждень машинного навчання (ML Week 2025), у якому узяли участь студенти 4-х університетів:

- Національний технічний університет України “Київський політехнічний інститут імені Ігоря Сікорського” (кафедра прикладної математики)

- Національний університет “Львівська політехніка” (кафедра систем штучного інтелекту)

- Національний університет Харківський політехнічний інститут (кафедра комп'ютерного моделювання та аналізу даних, кафедра системного аналізу та інформаційно-аналітичних технологій, кафедра кібербезпеки)

- Національний університет “Одеська політехніка” (кафедра штучного інтелекту та аналізу даних).

 `,
      String.raw`З 27 по 31 січня у смт Славсько (Львівська обл.) проходив тиждень машинного навчання (ML Week 2025), у якому узяли участь студенти 4-х університетів:

- Національний технічний університет України “Київський`,
    ],
  ])('real', (input, expected) => {
    const actual = shortenByWord(input, 200);

    expect(actual).toEqual(expected);
  });
});
